{"story":{
"title":"Sister's Introduction to Nudism Ch. 01",
"author":"Ozsunlover",
"author_link":"https://www.literotica.com/stories/memberpage.php?uid=1271904&page=submissions",
"pages":"2",
"curr_page":"2",
 "source":"https://www.literotica.com/s/sisters-introduction-to-nudism-ch-01",
 "k_src":"https://www.literotica.com/s/sisters-introduction-to-nudism-ch-01?page=2",
"story":[["<div><p><i>* This is a long and slow moving tale. It is not the type of story filled with rampant sex I has a slow erotic build.</i><br  />\n", "<br  />\n", "*<br  />\n", "<br  />\n", "My whole family has always known I was a nudist. At least I had told them often enough. But for the most part they just laughed it off and never inquired as to what I and my wife did as nudists, or where.<br  />\n", "<br  />\n", "Living in the city I don't get to see my siblings much as they all still live in the country, but we do all chat regularly, and thanks to Skype we now keep in better touch than ever. This is a story of how my elder sister became interested in Nudism.<br  />\n", "<br  />\n", "Now that our kids have left home and my business allows me to work from a home office, I spend nearly all my time naked. Nothing sexual - well usually not - just sitting at my desk and working in the buff. <br  />\n", "<br  />\n", "This particular day I was typing away at a pretty boring contract when my sister Karen buzzed me on Skype. Forgetting I was naked I took the call and up she popped on the webcam.<br  />\n", "<br  />\n", "\"Hey, little bro\" she chirped, \"How's it going....my god are you naked?\"<br  />\n", "<br  />\n", "\"Well, yeah\" I replied, \" But don't sweat it, I am sitting down and I promise you won't get a show.\"<br  />\n", "<br  />\n", "She laughed and we chatted a bit, catching up on the family news. After a while she brought the conversation back to nudity.<br  />\n", "<br  />\n", "\"So you weren't kidding huh? You really are a nudey?\"<br  />\n", "<br  />\n", "\"Sure I am\" I told her. \"Always have been.\"<br  />\n", "<br  />\n", "\"So do you go to Nudist Colonies or what?\" she asked.<br  />\n", "<br  />\n", "\"I don't think they have called them that since the 70s \" I laughed. \"But yeah, we go to a Naturist resort, camping or staying in a cabin there. Wanna see it?\"<br  />\n", "<br  />\n", "\"See what?\" she laughed, \" You better not stand up right now.\"<br  />\n", "<br  />\n", "\"I meant the resort goofy. Would you like to see what it looks like? I can send you a link to their website.\"<br  />\n", "<br  />\n", "She eagerly agreed and I popped a link into skype for her to check out.<br  />\n", "<br  />\n", "The resort we favour is a couple of hours out of the city, set in a valley with a small winding river. It has a nice rec area with pool, spa and sauna, a little restaurant and general store, and cabins or campsites to rent.<br  />\n", "<br  />\n", "Karen was flicking through the website and asking me a whole bunch of questions about the place -- did people really play nude volleyball? What sort of people went there? How the hell did one get up the courage to strip off in public?<br  />\n", "<br  />\n", "I answered as best as I could, explaining to her that very normal people went there, all shapes and sizes and from all walks of life, And that they were just like anybody else except for the fact that they liked to live naked. <br  />\n", "<br  />\n", "\"So you are telling me there is nothing at all sexy about it? \" Karen asked<br  />\n", "<br  />\n", "\"That's exactly what I am saying,\" I told her. \"Naturism is not about sex\".<br  />\n", "<br  />\n", "The thing is, I know that is not strictly true, and there are many nudists who are swingers and vice versa, and many others enjoy it for voyeuristic or exhibitionism thrills, but you feel you have to keep up Naturism's good name when talking to textiles, particularly family members. <br  />\n", "<br  />\n", "After asking me how often we went to the resort and when our next trip there would be the conversation drifted back to family stuff and after goodbyes and a promise to call my mother more often, I got back to work.<br  />\n", "<br  />\n", "_<br  />\n", "<br  />\n", "A few days later my wife told me she had to go to Europe again on one of her business trips. With a two day haul to Paris and a bunch of conferences to attend she would be away for two weeks, right at the time when we had planned to take our summer holiday. I had been cooped up in the city for months and had been really looking forward to our ten days in the cabin at the Nudist Resort. Bummer.<br  />\n", "<br  />\n", "\"You can still go without me\" my wife tried to console me.<br  />\n", "<br  />\n", "\"No thanks\" I said, \"No fun without you.\"<br  />\n", "<br  />\n", "Which is true, although we occasionally meet casual friends at the camp, 10 days alone in the cabin was not something I relished, and besides, a single man at a Nudist Resort always looks a bit sad and lonely to me, and I didn't like the idea of others feeling sorry for me, or worse, thinking I was some kind of perve.<br  />\n", "<br  />\n", "\"There'll be other times,\" I said. \"I'm sure I'll find plenty to do around the house.\"<br  />\n", "<br  />\n", "_<br  />\n", "<br  />\n", "The next day I found myself chatting to Karen over the net again and telling her my troubles. Not that she cared a lot; she was more envious of my wife and her business trips.<br  />\n", "<br  />\n", "\"I'd love a job like that\" she said, \"I never go anywhere!\"<br  />\n", "<br  />\n", "\"It's just work for her \" I said \"She'd rather be with me at the resort\"<br  />\n", "<br  />\n", "\"The nudey place?\"<br  />\n", "<br  />\n", "\"Yeah, we had planned a summer break. Can't do it now.\"<br  />\n", "<br  />\n", "\"Too bad little brother\" Karen laughed. \"Can't you go there and get nakey alone?\"<br  />\n", "<br  />\n", "\"No, a holiday alone is not a holiday\" I said<br  />\n", "<br  />\n", "\"At least you get holidays\" she replied \"I never get out if this town.\"<br  />\n", "<br  />\n", "\"Well you are welcome to come with me if you like\" I said, \"It's all booked anyway.\"<br  />\n", "<br  />\n", "\"Not me,\" Karen giggled. \"I have absolutely no desire to get my bits out in public, or to see others do it either.\"<br  />\n", "<br  />\n", "\"Chicken\" I teased, and again we moved on to mundane family topics.<br  />\n", "<br  />\n", "And yet, and hour after we had hung up the call, a message from Karen suddenly appeared in the text box.<br  />\n", "<br  />\n", "\"I decided to come.\"<br  />\n", "<br  />\n", "I typed back in return \"To where?\"<br  />\n", "<br  />\n", "\"Your nudey camp.\"<br  />\n", "<br  />\n", "\"No way!\"<br  />\n", "<br  />\n", "\"No really, I decided. I want to, I can fly up Monday morning and you can get me from the airport.\"<br  />\n", "<br  />\n", "\"Look, are you sure? I mean I don't mind at all if you come, but it is a Nude resort, and we will be naked all week.\"<br  />\n", "<br  />\n", "\"You will, I won't. The website clearly says clothing optional. So I opt for clothes , LOL\"<br  />\n", "<br  />\n", "\"OK, that's up to you, but be prepared, everyone else will be mostly naked.\"<br  />\n", "<br  />\n", "\"Well, duh. I kinda figured that out. Anyway, will you pick me up from the airport?\"<br  />\n", "<br  />\n", "\"Sure, unless you chicken out, which I am sure you will. :)\"<br  />\n", "<br  />\n", "\"We'll see. What do I need to bring?\"<br  />\n", "<br  />\n", "I explained to her that the cabin was fully equipped and that I would provide the food and drinks. All she needed to bring was her essentials, and a good-sized beach towel.<br  />\n", "<br  />\n", "\"And clothes?\" She asked<br  />\n", "<br  />\n", "\"Up to you,\" I replied, \"I usually take as little as possible, a set of clothes to wear on the way there and back, and maybe a sweater in case it turns cold, which it won't. If you must wear clothes just bring something casual and comfy, oh and some sturdy shoes in case we go bush-walking.\"<br  />\n", "<br  />\n", "Later I told my wife about Karen's offer. She thought it was a big hoot and agreed with me that Karen would back out at the last minute.<br  />\n", "<br  />\n", "\"She is my favorite of your sisters.\" She said \"But even she would be too prudish to go through with it.\"<br  />\n", "<br  />\n", "\"But if she does?\" I asked.<br  />\n", "<br  />\n", "\"If she does, you will get your holiday and I won't have to come home to a grumpy hubby.\" She laughed.<br  />\n", "<br  />\n", "The next week flew by. Sunday saw me drop my wife at the airport for her trip and then I kicked around the house and finished up some business I had to do online before sitting back with a beer and deciding what DVDs I would take to watch while at the resort (which has no TV reception -- both a good and a bad thing, depending on your mood)<br  />\n", "<br  />\n", "I was transferring a lot of movies to a laptop hard drive when Karen buzzed me on skype again. Up she popped on webcam. I was naked but only showing from the waist up. <br  />\n", "<br  />\n", "\"I land at 7:45am, will you be there to get me?\"<br  />\n", "<br  />\n", "\"Sure, but you better show, I already paid for the cabin.\"<br  />\n", "<br  />\n", "\"I'll be there.\"<br  />\n", "<br  />\n", "\"Hey there is no TV there so I am taking some movies on the laptop to watch, any preferences?\"<br  />\n", "<br  />\n", "\"No, anything is fine. And I have a few books to read.\"<br  />\n", "<br  />\n", "\"Cool. There is also a little library there if you run out.<br  />\n", "<br  />\n", "It was then I noticed her bare shoulders, was she naked too? No, it couldn't be.<br  />\n", "<br  />\n", "\"Hey Sis, are you getting in the swing of things already?\" I asked.<br  />\n", "<br  />\n", "\"What?\"<br  />\n", "<br  />\n", "\"I mean, umm are you naked now?\"<br  />\n", "<br  />\n", "\"Don't be bloody stupid?\" she laughed, standing up to show the sarong she had wrapped around her.\" As if I would be sitting here naked when James is in the next room.\"<br  />\n", "<br  />\n", "\"Oh right.\" I said, remembering how conservative her husband was, \"Does he know where we are going?\"<br  />\n", "<br  />\n", "\"No he doesn't. He knows I am going camping with you that's all. Perhaps I'll tell him when I get back. By the way\" she did a little twirl \"Do you think my outfit will be OK for the resort?\"<br  />\n", "<br  />\n", "I told her it looked fine, not bothering to mention that not many at the resort would care in the least what anyone was wearing. But she did look good in it. Karen is six years older than me, and at forty-seven she looks about the same age as me. While I am slim and fair, she is dark haired and somewhat buxom, Junoesque even. And as she twirled I was treated to the sight of her firm large ass stretching the fabric of the sarong tight and as she turned back her ample bosom in profile looked even larger with the top of the sarong defining them....and holy crap! I realized my dick was lifting from my lap, stretching and twitching and quite definitely on its way to an erection.<br  />\n", "<br  />\n", "I scrunched up closer to my desk to make sure it couldn't be seen on the webcam and when Karen sat down and asked again what I thought of her outfit I babbled something about it being just the ticket and told her I had to get off the net now and get packed for tomorrow.<br  />\n", "<br  />\n", "\"See you in the morning Little Brother\" she said, leaning in to the cam to blow as kiss as she usually did, \"See lots of you tomorrow I guess, hahaha.\"<br  />\n", "<br  />\n", "I spent an uneasy night, wondering why my sister should have suddenly had that effect on me, and what tomorrow would bring.<br  />\n", "<br  />\n", "Monday.<br  />\n", "<br  />\n", "We were on the road. I had picked up Karen and her ridiculously large suitcase from the Airport and we had shot straight onto the freeway on our way to the resort. The parking at the airport was a nightmare as usual and we had only the time for the briefest hug before we had jumped in the car and hauled out of there.<br  />\n", "<br  />\n", "Now as the open road sped by we chatted about just about everything except where we were headed. The sun was out, it was just this side of too hot and Miles was playing on the sound system. Being country bred I always get a great sense of freedom and peace just driving down the highway, looking at the hills and the rivers going by, and today was no exception. Karen had not been on this road before and it was all new to her and as she said, a lovely break from the daily drive she had from her small country town house to her small country town job.<br  />\n", "<br  />\n", "We pulled into a shopping centre in the last town before the turn-off to the resort. I gave Karen my keycard and PIN number and told her to go nuts in the supermarket and get enough nibblies and easy to prepare food to last us a week or more, while I went to the liquor store to get the other essentials.<br  />\n", "<br  />\n", "\"What's your tipple these days?\" I asked.<br  />\n", "<br  />\n", "\"Oh I'm easy, local wine if they have it\" she said. \"Maybe some Bourbon? I don't drink much these days, but considering where we are going I might need a couple of stiff ones.\"<br  />\n", "<br  />\n", "She looked at me and just knew I had half a dozen jokes about \"stiff ones\" ready to go. <br  />\n", "<br  />\n", "\"Don't you dare \" she said in hushed tones and took off to the Supermarket. As I watched her go, I reflected that of all our siblings, we two had always been the most in synch, we just seemed to be on the same wavelength and 'get' each other more than the others.<br  />\n", "<br  />\n", "Karen was wearing jeans and a loose fitting sky blue blouse and as I watched her walk into the market, I wondered how she would look in real life in that sarong, or a bathing suit even. Oddly enough, though I had never been an \"ass man\", I found myself staring at her rump as she went, and liking it. <br  />\n", "<br  />\n", "\"Where is this coming from?\" I thought, and put it from my mind and got on with the shopping.<br  />\n", "<br  />\n", "10:30 am and we were back on the road, driving at a leisurely pace down the dirt road that meandered through hills to take us to the Resort. We were well stocked with all the necessities and as always I could not wait to get to the cabin, get unpacked and chill out.<br  />\n", "<br  />\n", "\"How much further?\" Karen asked.<br  />\n", "<br  />\n", "\"See that big tree with the dirt track by it?\" I said, \"We're almost at the gate, last chance to chicken out.\"<br  />\n", "<br  />\n", "\"Like hell\" she said, \"I've come this far. I just want to ask....\"<br  />\n", "<br  />\n", "\"What?\"<br  />\n", "<br  />\n", "\"Well, if I do find it too much, can I just stay in the cabin and not 'see' anyone?\"<br  />\n", "<br  />\n", "\"Sure you can,\" I said, \"But hey listen, if you are truly uncomfortable when we are there, at any time, you just say so and we will pack up and go home, OK?\"<br  />\n", "<br  />\n", "\"Are you serious?\" she asked. \"Oh, I don't want to ruin your holiday.\"<br  />\n", "<br  />\n", "\"Don't worry about a thing.\" I said, \"I am a nudist, but I know that it is not for everyone. If it doesn't feel right for you, we can leave. OK?\"<br  />\n", "<br  />\n", "Karen ruffled my hair, \"You're sweet Little Brother. Thanks\"<br  />\n", "<br  />\n", "By now, we had arrived at the main car park. Tucked in the valley by the river, with forty or so cabins spaced about in the bush, the reception and office was beyond the main pool area, and as it and the pool were up higher than the car park, we could see no one from where we sat, although the sounds of laughter and splashing drifted down to us. <br  />\n", "<br  />\n", "In the rear view mirror I saw a middle aged couple walk from their cabin up the steps toward the pool. Karen, looking back to see what I was looking at just saw their naked butts as they turned the corner.<br  />\n", "<br  />\n", "\"Well\" she said, \"I've seen more first nudies. And survived!\"<br  />\n", "<br  />\n", "\"As the song goes; you ain't seen nothing yet \" I said \" I got to go and sign in, coming?\"<br  />\n", "<br  />\n", "\"Mmm, I'll just wait here if that's OK\" she said.<br  />\n", "<br  />\n", "I ran up to the office to sign in and get the key. There were maybe around a dozen people lounging by the pool, a pretty normal crowd for the time of day, but I saw no one I knew and didn't hang around to meet anyone.<br  />\n", "<br  />\n", "Back in the car and I decided to take a slow drive through the camp to acquaint my sister with the layout. With the help of the small map I had got at the office I showed her where the shower blocks and BBQ areas were and what the campgrounds down by the river looked like. Here and there we saw nude people or couples, but all at a distance and nothing too 'in your face'. Karen looked around at everything as we drove through, even waving to a naked old dude who was sitting by his camper on the side of the road as we headed back up. He was only yards from us, and legs wide open he was fully on display to my sister as we drove past slowly.<br  />\n", "<br  />\n", "\"Everything OK?\" I asked her.<br  />\n", "<br  />\n", "\"Y..ess. So far\" she replied. \"Its not what I imagined.\"<br  />\n", "<br  />\n", "\"Oh? In what way?\"<br  />\n", "<br  />\n", "She laughed, \"I guess I was picturing lots of Porn star or supermodel types here, but as you told me, they are all just normal people.\"<br  />\n", "<br  />\n", "\"Disappointed?\" I teased.<br  />\n", "<br  />\n", "\"Nope, relieved if anything\" she answered. \"Now I feel a lot less pressure if I decide to..\"<br  />\n", "<br  />\n", "She left the sentence hanging and I didn't push her. Instead I drove in and parked out our cabin. <br  />\n", "<br  />\n", "\"Here we are!\"<br  />\n", "<br  />\n", "The cabin was only a hundred yards from the pool area. Self contained with a nice little porch and a view of the river. Sis located it on her little map and nodded appreciatively<br  />\n", "<br  />\n", "\"Nice\"<br  />\n", "<br  />\n", "I was already out of the car and lugging stuff onto the porch. I threw her the door key and asked her to check that the fridge was running. \"Priorities\" I called. \"Gotta get the beer cold.\"<br  />\n", "<br  />\n", "Karen ran onto the porch and disappeared into the little wooden cabin while I continued to unload the car. I was just shouldering a case of beer and heading for the door when she came out.<br  />\n", "<br  />\n", "\"Tim\" she said, looking doubtful. \"There is only one bedroom!\"<br  />\n", "<br  />\n", "Most of the cabins are like that, a living cum dining room, and a bedroom. I never even considered that there might be two bedroom cabins.<br  />\n", "<br  />\n", "\"Hey no problem\" I said, \"The sofa is a fold out bed. You'll be comfy on that\" I grinned.<br  />\n", "<br  />\n", "Again she looked doubtful.<br  />\n", "<br  />\n", "\"I'm kidding!\" I said. \"You take the bedroom, I'll take the sofa. No big deal.\"<br  />\n", "<br  />\n", "We spent twenty minutes putting away groceries and getting organized, and by the end I was all for grabbing a cold beer and chilling on the porch -- pre lunch. <br  />\n", "<br  />\n", "Karen looked across from the small kitchen to me.<br  />\n", "<br  />\n", "\"Well, I think I'll go into my room and change and I guess you'll....\"<br  />\n", "<br  />\n", "\"Ah\" I said, \"the moment of truth. Yes Karen, I am gonna get my gear off and relax. This is sort of where we find out if you can handle it or not I guess.\"<br  />\n", "<br  />\n", "She was staring at me, as if she expected some type of striptease and looking pretty nervous about it.<br  />\n", "<br  />\n", "\"Tell you what, \" I said. \"You go change and I will go sit on the porch and have a beer. When you are ready you can come out, and I'll be naked when you do, OK?\"<br  />\n", "<br  />\n", "She relaxed visibly. \"Thanks Tim\"<br  />\n", "<br  />\n", "She went into the bedroom and I threw off my clothes, grabbed a towel and a beer and the paper and went out to the porch and sat at the little table there. <br  />\n", "<br  />\n", "Man it felt good to be back, body open to the air and the peace and quiet of the country just seeping in and blowing away all the stress and hassle of city life. I read the paper, sipped my beer and smiled.<br  />\n", "<br  />\n", "\"Tim?' Karen's voice called from inside. \"I'm coming out now. Are you decent?\" <br  />\n", "<br  />\n", "We laughed and I called her a goof and then she was out the door and the first big plunge was made. She was in her sarong, and looking good with it as she came to sit the other side of the table. And even though my dick was hidden from her view, she was, for the first time, sitting chatting to her naked younger brother.<br  />\n", "<br  />\n", "\"You OK?\" I asked<br  />\n", "<br  />\n", "\"Sure\" she said, \"you might just as well be shirtless sitting there like that, no big deal.\"<br  />\n", "<br  />\n", "\"Cool\"<br  />\n", "<br  />\n", "\"I see you still keep yourself nice and slim, how I envy that.\" She went on.<br  />\n", "<br  />\n", "\"Swimming\" I said, \"Or metabolism, or both, who knows. But hey you look good too Sis. Really.\"<br  />\n", "<br  />\n", "She looked down at herself doubtfully, flexing her arms and legs.<br  />\n", "<br  />\n", "\"Oh I am fit enough, \" she said, \"but still all Tits and Bum, Always was, always will be I guess.\"<br  />\n", "<br  />\n", "\"You're fine,\" I said. \"Have a drink before lunch?\"<br  />\n", "<br  />\n", "\"Mm, OK. Might just have a beer,\" she said.<br  />\n", "<br  />\n", "\"Help yourself,\" I replied, \" Plenty there.<br  />\n", "<br  />\n", "\"Hey!\" I am a guest she pouted. \"You go get me one!\"<br  />\n", "<br  />\n", "Here goes, I thought, and stood up quickly and walked past her into the cabin, not looking back.<br  />\n", "<br  />\n", "Moments later I was back with more beers, standing right in front of her to give her one. This time there was no way she could not see all of my dick and balls hanging right there two feet from her face. Now it's out there and over and done with I thought and resumed my seat.<br  />\n", "<br  />\n", "We sipped our beer in silence for a while, until Karen said.<br  />\n", "<br  />\n", "\"Well. Here I am, and I have seen my little brother's penis and if that's the worst that can happen, then I think I will manage this holiday.\"<br  />\n", "<br  />\n", "\"You OK with it then?\" I asked.<br  />\n", "<br  />\n", "\"Yeah\" she smiled at me, and added teasingly \"it's no big thing.\"<br  />\n", "<br  />\n", "\"Hey, keep your judgments to yourself \" I laughed, \"Cheers\"<br  />\n", "<br  />\n", "We clinked bottles and sat back drinking in the cold beer. And I was very comfortable with the whole idea of her being there with me.<br  />\n", "<br  />\n", "_<br  />\n", "<br  />\n", "A couple of more beers and a lovely fresh chicken sandwich that Karen whipped up for us and we were feeling no pain. It was early afternoon and we continued to sit on the porch and chat.<br  />\n", "<br  />\n", "\"So\" Karen said. \"Naturism, tell me more.\"<br  />\n", "<br  />\n", "\"Such as?\"<br  />\n", "<br  />\n", "\"Well, etiquette for example.\" She leaned on the table and I could sense one of her deep and meaningful conversations coming on. \"I read the website about towels and no erections and no photos or staring etc, but tell me, are nudists even allowed to mention body parts? I have to say you all sound a bit prudish to me.\"<br  />\n", "<br  />\n", "\"Interesting question,\" I replied, \" I think a lot of us are not comfortable with discussing body parts openly with people we don't know well, because we don't want people to think we are hitting on them or perving too much.\"<br  />\n", "<br  />\n", "\"There ya go,\" she countered. \"Prudey! Prudey Nudeys.\" She smiled at me over her beer.<br  />\n", "<br  />\n", "\"No more than textiles\" I said.<br  />\n", "<br  />\n", "\"Oh?\" she asked. \"Are you sure? Textiles at a resort are allowed to hit on each other, you guys aren't. Big difference see?\"<br  />\n", "</p></div>"]]
}}
