{"story":{
"title":"Sister's Introduction to Nudism Ch. 01",
"author":"Ozsunlover",
"author_link":"https://www.literotica.com/stories/memberpage.php?uid=1271904&page=submissions",
"pages":"2",
"curr_page":"2",
 "source":"https://www.literotica.com/s/sisters-introduction-to-nudism-ch-01",
 "k_src":"https://www.literotica.com/s/sisters-introduction-to-nudism-ch-01?page=2",
"story":["<div><p>"Who says textiles are 'allowed' to hit on each other?" I asked.<br  />
<br  />
"Oh, look around you little brother," she laughed, "Do you think the human race would have lasted this long if people didn't hook up sometime? From where I sit, a world populated by 'naturists' we be depopulated in two generations. Haha, nobody would ever have the guts to ask any one for a date!"<br  />
<br  />
I refrained from telling her of some of the 'hookups' we had seen at this very resort. But I had to admit she did have a point. It was one reason why I hated coming here alone. Very few people would talk to you because there is an awful vibe that a single male nudist is only there to try and meet women. And ironically they are pretty much doomed to remain alone.<br  />
<br  />
"You see a lot Dr Lector," I said in my best Jodie Foster voice. "But are you willing to turn that high powered perception on yourself? Or maybe you're afraid to."<br  />
<br  />
"I am afraid of nothing," she laughed, "As a textile I can even mention body parts if I want."<br  />
<br  />
"Oh?"<br  />
<br  />
"Yes," she smirked. "Your penis for example. I was kidding before, we always knew you must have a big one, and now I alone in the family know the whole truth -- you have a huge wanger."<br  />
<br  />
"Well do me a favour and keep that a secret, huh?"<br  />
<br  />
"Please" she laughed, "from the day you hit puberty we could all see it. Don't you remember the 80s and those stretch jeans everyone wore?"<br  />
<br  />
"OK OK, so I have a wanger, move on" I chuckled.<br  />
<br  />
"And I thought you were uncircumcised?" she pondered.<br  />
<br  />
Now, I am uncut - I just happen to be one of those guys whose foreskin does not cover the glans, only usually half way down, and if I am at all swollen, the foreskin rolls straight back so even flaccid I can look circumcised.<br  />
<br  />
"I am, I just don't have a long foreskin, that's all" I explained to Karen.<br  />
<br  />
She leaned over the table to examine it. "Oh I see now," she said. "Your willy is too big for your foreskin."<br  />
<br  />
"I don't know if that is the medical definition, but yeah. Maybe."<br  />
<br  />
"So how big is it?" <br  />
<br  />
"Dunno," I said, "Never measured it"<br  />
<br  />
"Show me a man that hasn't measured his penis and I'll show you a liar" she laughed.<br  />
<br  />
Now here is one good reason why Naturists don't discuss body parts. Because a lot of men find it impossible to listen to a woman discuss their dick and not get a hard-on. It just seems as if the dick is listening in and wants to looks its best while it is the centre of attention. And right now I felt that twitch and roll that told me I was sporting half a woody. 'Time to think about cricket,' I thought to myself.<br  />
<br  />
"Well if that's your thing there are plenty of guys around here you can do a survey on if you like" I said, "But my wanger is off limits."<br  />
<br  />
"Spoilsport" she smiled. "I'll do my survey without you, you're probably not normal anyway."<br  />
<br  />
"You talk a big game," I said, "but lets see you go to the pool area and see how prudish you really are."<br  />
<br  />
"Ready when you are." <br  />
<br  />
Damn, truth was I wasn't ready. My dick was still at half mast and I didn't want to leave the table.<br  />
<br  />
"Ok" I said, "can you ahh, get the small cooler and a few more drinks, and sunscreen and stuff, while I lock the car?"<br  />
<br  />
She went inside the cabin and I ran to the car. With a little concentration I had my dick back to almost entirely flaccid, though just to be safe I hung my towel over my shoulder in the 'ready to cover the goods' position.<br  />
<br  />
Karen came back out, her sarong still firmly in place and a big hat and sunglasses shading her. We walked up the footpath toward the pool, and as nonchalant as she pretended to be, the fact that she reached out and took my hand told me how nervous she really was.<br  />
<br  />
The pool area was filling up with people. Its sort of tradition that everyone brings their drinks up to the pool for 'happy hour'. <br  />
<br  />
There are really two pools, one large, one small and four spas dotted around the large decked area. There are also benches and tables under a shaded canopy, showers and a sauna. <br  />
<br  />
There were around twenty people there already. Mostly middle-aged couples who were residents and who all knew each other fairly well. <br  />
<br  />
I was on nodding acquaintance with some of them and we said a few quick "Hi"s here and there. We put our stuff on a bench and stretched out on our towels on the deck to catch some sun. <br  />
<br  />
Sitting right in front of us were a couple around our age - a slim bald guy with an Asian wife. They were both concentrating on a game of scrabble they were playing and apart from a brief smile, paid us no mind. I wasn't staring at the wife but over the top of my book I could see she had one leg tucked under her and from the angle of me laying on the deck looking up I had a perfect view of a lovely hairless slit right in front of me. I glanced at it from time to time, not feeling particularly turned on, just admiring its neatness and its symmetry.<br  />
<br  />
Her husband had a long thin cock, hanging down over the edge of his seat, three feet away from Karen's face, but with her sunglasses on I had no way of knowing if she was checking him out or not.<br  />
<br  />
Behind us in the pool people floated lazily and chatted about their cabins, their jobs, their cars -- all the usual stuff. While in the spa to our left a very fit looking couple were showing off their new his and her tattoos to a lone older German guy, who seemed to have an opinion on just about everything.<br  />
<br  />
The book I was reading was heavy going, I had had more beers than I was used to and the sun soon lulled me to sleep.<br  />
<br  />
I must have dozed for twenty minutes or so, and the first thing I saw on awaking was the Asian woman in front of me gently scratching one side of her pussy, and for a split second I glimpsed two very sweet looking inner lips, that peeked out as her hand moved across her labia. A very quick show, and nothing overly erotic, just the occasional little 'bonus' one sees among nudists that you acknowledge and move on. <br  />
<br  />
The second thing I noticed, on looking to my left, was that Karen was gone, and her sarong was left crumpled up on her towel.<br  />
<br  />
I sat up quickly looking for her and she called to me.<br  />
<br  />
"You're awake then? Did you know you snore?" <br  />
<br  />
She was in the pool treading water and chatting to the older German guy. She was wearing a black one-piece swimming costume. It was strapless and under the water I could see that it was not giving the support needed to her large breasts that seemed to bob and float before her with a perpetual rhythm of their own. The German guy, although he was chit-chatting to her about film and TV and whatnot, was clearly intrigued by my sister's tits and would glance at them every second.<br  />
<br  />
"C'mon in" she called. "Its beautiful."<br  />
<br  />
I jumped in and swam over to her and she introduced me to Karl. It soon became apparent that she had told him most of our life story and he complimented me on being good enough to treat my sister to a holiday. Karl was a regular, in fact he owned his own cabin at the resort and now he was retired he rarely left the place.<br  />
<br  />
He was short and stocky and hairy and sported a very impressive uncut cock, easily two inches longer than mine flaccid. I wondered if Karen had noticed? I guess she must have because he was also one of those guys that reach down and absently scratch or tug their dick every minute or so.<br  />
<br  />
"I was trying to convince your sister to try nudism," he said to me. "But she is still reluctant."<br  />
<br  />
This was just what I didn't need. Some old guy freaking out Karen on her first day.<br  />
<br  />
"She is just here for a visit," I told him. "So you can understand that she is not ready to be naked."<br  />
<br  />
"Not today anyway," smiled Karen and swam over to me and put a sisterly arm around my shoulder.<br  />
<br  />
We drifted suddenly to a deeper part of the pool and instinctively my arm reached out to steady myself and I found it wrapped around Karen's ample waist. <br  />
<br  />
She must have thought I was trying to duck her and she squealed and pushed me underwater with both her hands on my shoulders. I came up spluttering and tried to do the same to her but she grabbed me in a bear hug and fought me off, her large breasts were pressed against me tight and I could feel my dick squeezed up against her tummy. <br  />
<br  />
Karl was smiling at us, and I decided I didn't like the leer he had on his face so I broke off and left the pool.<br  />
<br  />
Karen soon joined me and after sunbathing a little more we decided to head back to the cabin for dinner. As we left at least half a dozen people called "Bye Karen!"<br  />
<br  />
It seems while I dozed she had made plenty of friends.</p></div>"]
}}
